;-----------------------------------------------
; ABILITIES - MW CHANGE - ADD PROMOTION POPUP
;-----------------------------------------------

[RoboticChassis X2AbilityTemplate]
LocFriendlyName="Mechatronic Unit"
LocLongDescription="This unit is immune to fire and poison damage, and provides full cover to adjacent units.\nCannot be affected by mind control and other similar psi powers."
LocHelpText="This unit is immune to fire and poison damage, and provides full cover to adjacent units.\nCannot be affected by mind control and other similar psi powers."
LocPromotionPopupText="This unit is immune to fire and poison damage, and provides full cover to adjacent units.\nCannot be affected by mind control and other similar psi powers."

;-----------------------
; TECHS - BAYS
;-----------------------

[ExpandRepairBay X2TechTemplate]
DisplayName="Expand Repair Bay I"
Summary="With our knowledge of the ADVENT's MEC construction techniques and some moving of storage, we can add another maintenance bay to Engineering.\n\nThis will allow more SPARKs and ROBOTICS to be repaired at the same time and increase the speed we can perform repairs."

[ExpandRepairBay2 X2TechTemplate]
;DisplayName="Expand Repair Bay - Again"
DisplayName="Expand Repair Bay II"
Summary="With our knowledge of the ADVENT's MEC construction techniques and some moving of storage, we can add another maintenance bay to Engineering.\n\nThis will allow more SPARKs and ROBOTICS to be repaired at the same time and increase the speed we can perform repairs."

[ExpandRepairBay3 X2TechTemplate]
;DisplayName="Expand Repair Bay - One Last Time, Maybe?"
DisplayName="Expand Repair Bay III"
Summary="With our knowledge of the ADVENT's MEC construction techniques and some moving of storage, we can add another maintenance bay to Engineering.\n\nThis will allow more SPARKs and ROBOTICS to be repaired at the same time and increase the speed we can perform repairs."

[ExpandRepairBay4 X2TechTemplate]
;DisplayName="Expand Repair Bay - You Could Fit A Battlemech In There"
DisplayName="Expand Repair Bay IV"
Summary="With our knowledge of the ADVENT's MEC construction techniques and some moving of storage, we can add another maintenance bay to Engineering.\n\nThis will allow more SPARKs and ROBOTICS to be repaired at the same time and increase the speed we can perform repairs."

;-----------------------
; TECHS - CREATION
;-----------------------

[BuildSpark X2TechTemplate]
DisplayName="Build SPARK - Create New Unit"
Summary="Build a SPARK robotic combat unit with a new personality matrix and with baseline combat data.\nSPARKs have an advantage over humans: they don't lose everything when they experience catastrophic damage. The datacore might be recovered and the chassis rebuilt.\nSPARK units do not take up any Living Space on the avenger and are repaired in Engineering."

[BuildExpSpark X2TechTemplate]
DisplayName="Build SPARK - Create Advanced Unit"
Summary="Build a SPARK robotic combat unit with a new personality matrix and with advanced combat data.\nSPARKs have an advantage over humans: they don't lose everything when they experience catastrophic damage. The datacore might be recovered and the chassis rebuilt.\nSPARK units do not take up any Living Space on the avenger and are repaired in Engineering."

[RebuildSpark X2TechTemplate]
DisplayName="Build SPARK - Rebuild From Core"
Summary="Build a SPARK robotic combat unit and insert a recovered datacore. The unit will have the same personality as its predecessor, and most of its acquired experience and ranks will be restored.\nIt will be one rank lower than it was, but at least the minimum rank required for SPARKs.\nThe SPARK may need field experience to calibrate this old software to the new hardware."

[RM_ConvertMEC X2TechTemplate]
DisplayName="Build SPARK - Salvage MEC Wrecks"
Summary="Designed by the late Dr. Raymond Shen before the initial invasion some 20 years ago, the SPARK robotic prototype served as the progenitor for all future ADVENT MEC designs.\nWe can use that against ADVENT: with enough salvage from wrecked MECs, we can make a SPARK robotic combat unit from components and with some additional supplies can install a new datacore."

[RM_SparkSergeantTech X2TechTemplate]
DisplayName="Advanced SPARK Programming"
Summary="Now that we have an experienced complement of encounters with ADVENT MECs, we should be able to create a better base for our SPARK units using the combat data of our prior missions. This would enable us to build SPARKs that start off as experienced units."

;-----------------------
; ITEMS - CORES
;-----------------------

[Rusty_RecoverCores X2TechTemplate]
DisplayName="Recover SPARK Cores"
Summary="We have a signal beacon from the datacore of a SPARK that fell in combat, located nearby. ROV-R can fly out to find and collect these almost immediately. If we collect these cores we can use them to rebuild a fallen SPARK."

[CorpseSpark X2ItemTemplate]
FriendlyName="<font color='#E67A0E'>SPARK Datacore</font>"
FriendlyNamePlural="<font color='#E67A0E'>SPARK Datacores</font>"
BriefSummary="The datacore of an XCOM SPARK unit that has fallen in combat. They are sent near to the Avenger when the SPARK unit is destroyed. The emergency eject can slightly damage and corrupt them. These datacores can be inserted into a new SPARK robotic combat chassis in the Proving Grounds to regain the SPARK's personality and accrued combat abilities." 

;-----------------------
; STAFF SLOTS
;-----------------------

[SparkStaffSlot X2StaffSlotTemplate]
EmptyText="OPEN: ROBOT REQUIRED"
BonusEmptyText="Begin ROBOTIC repairs."
BonusText="REPAIRING ROBOT"
FilledText="Repairing %UNITNAME !"
LockedText="LOCKED: BUILD ROBOT"

[SparkStaffSlot1 X2StaffSlotTemplate]
EmptyText="OPEN: ROBOT REQUIRED"
BonusEmptyText="Begin ROBOTIC repairs."
BonusText="REPAIRING ROBOT"
FilledText="Repairing %UNITNAME !"
LockedText="LOCKED: EXPAND BAYS"

[SparkStaffSlot2 X2StaffSlotTemplate]
EmptyText="OPEN: ROBOT REQUIRED"
BonusEmptyText="Begin ROBOTIC repairs."
BonusText="REPAIRING ROBOT"
FilledText="Repairing %UNITNAME !"
LockedText="LOCKED: EXPAND BAYS"

[SparkStaffSlot3 X2StaffSlotTemplate]
EmptyText="OPEN: ROBOT REQUIRED"
BonusEmptyText="Begin ROBOTIC repairs."
BonusText="REPAIRING ROBOT"
FilledText="Repairing %UNITNAME !"
LockedText="LOCKED: EXPAND BAYS"

[SparkStaffSlot4 X2StaffSlotTemplate]
EmptyText="OPEN: ROBOT REQUIRED"
BonusEmptyText="Begin ROBOTIC repairs."
BonusText="REPAIRING ROBOT"
FilledText="Repairing %UNITNAME !"
LockedText="LOCKED: EXPAND BAYS"

;------------------------------------
; CUSTOM SPARK CLASS SUPPORT
; WITH MW AND MOF TO BUILD HIGHER RANK
;-----------------------------------

[SparkChooseClass X2SoldierClassTemplate]
;DisplayName="Choose SPARK"
;ClassSummary="Please Select a SPARK class."
LeftAbilityTreeTitle="---"
RightAbilityTreeTitle="---"

RankNames[0]="Choose Class"
RankNames[1]="Choose Class"
RankNames[2]="Choose Class"
RankNames[3]="Choose Class"
RankNames[4]="Choose Class"
RankNames[5]="Choose Class"
RankNames[6]="Choose Class"
RankNames[7]="Choose Class"

ShortNames[0]="Spk."
ShortNames[1]="Spk."
ShortNames[2]="Spk."
ShortNames[3]="Spk."
ShortNames[4]="Spk."
ShortNames[5]="Spk."
ShortNames[6]="Spk."
ShortNames[7]="Spk."

RankIcons[0]="UILibrary_DLC3Images.rank_squire"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
